#include <stdio.h>

int main() {
    int a = 0;
    int b = 0;
    float c = 1.2f;

    a = 200;
    b = 100;

    a = b;

    // 대입연산자의 규칙
    // 오른쪽 값과 왼쪽 값의 데이타 타입이 일치해야 대입연산이 
    // 일어납니다.

    // 기본데이타 타입간에는 컴파일러가
    // 묵시적으로 형변환을 시켜버립니다.
    a = c; // 실수를 정수형에 대입할때는 묵시적 형변환을 하시면 안됩니다.
    // 명시적으로 형변환을 하셔야 합니다.

    a = (int)c;   // 명시적 형변환

    c = a;

    // 대입연산자 축약형
    a = a + 1;
    a += 1;

    printf("a = %d\n", a);

    a = a - 1;
    a -= 1;

    a = a + b;
    a += b;





    return 0;
}
